Revit 2026 API

# SegmentRemoveSize Method

---

Remove the existing MEPSize with this nominal diameter from the segment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSize(
	double nominalDiameter
)
```
```vb
Public Sub RemoveSize (
	nominalDiameter As Double
)
```
```cpp
public:
void RemoveSize(
	double nominalDiameter
)
```
```fsharp
member RemoveSize :
        nominalDiameter : float -> unit
```

#### Parameters

nominalDiameter Double
     The nominal diameter of the size.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The last size of the segment cannot be removed. |

Does nothing if there is no existing MEPSize with this nominal diameter.

#### Reference

Segment Class

Autodesk.Revit.DB Namespace